src/Documents/ВводИзменениеОстатка/ВводИзменениеОстатка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводИзменениеОстатка</name>
  <registerRecords>AccountingRegister.ЖурналОпераций</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеОборотыБюджета</registerRecords>
  <attributes>
    <name>ВалютаОперации</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектУчета</name>
    <type>
      <types>Characteristic.ВидыСубконто</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОперации</name>
    <comment>(Инф.)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделУчета</name>
    <type>
      <types>ChartOfAccountsRef.РазделыУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеНовогоОстатка</name>
    <comment>(Инф.)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеНовогоОстаткаПроцентов</name>
    <comment>(Инф.)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДохода</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНовогоОстатка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНовогоОстаткаПроцентов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРасхода</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФинансоваяЦель</name>
    <type>
      <types>CatalogRef.ФинансовыеЦели</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоШаблон</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

src/AccountingRegisters/ЖурналОпераций/ЖурналОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>ЖурналОпераций</name>
  <chartOfAccounts>ChartOfAccounts.РазделыУчета</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделВалютнойОперации</name>
    <type>
      <types>ChartOfAccountsRef.РазделыУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектВалютнойОперации</name>
    <type>
      <types>Characteristic.ВидыСубконто</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВалютнойОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаВалютнойОперации</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

src/AccumulationRegisters/ФактическиеОборотыБюджета/ФактическиеОборотыБюджета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ФактическиеОборотыБюджета</name>
  <comment>Фактические обороты по статьям бюджета</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>РазделБюджета</name>
    <type>
      <types>CatalogRef.ФинансовыеЦели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяБюджета</name>
    <type>
      <types>DefinedType.СтатьяБюджета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипПоказателя</name>
    <type>
      <types>EnumRef.ТипыБюджетныхПоказателей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Кошелек</name>
    <type>
      <types>CatalogRef.КошелькиИСчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/ТипыСчетов/ТипыСчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСчетов</name>
  <enumValues>
    <name>Наличность</name>
  </enumValues>
  <enumValues>
    <name>БанковскаяКартаДебетовая</name>
  </enumValues>
  <enumValues>
    <name>БанковскаяКартаКредитная</name>
  </enumValues>
  <enumValues>
    <name>БанковскаяКартаУниверсальная</name>
  </enumValues>
  <enumValues>
    <name>БанковскийСчет</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныйКошелек</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ТипыБюджетныхПоказателей/ТипыБюджетныхПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыБюджетныхПоказателей</name>
  <enumValues>
    <name>Поступление</name>
  </enumValues>
  <enumValues>
    <name>Списание</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ФинансовыеЦели/ФинансовыеЦели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФинансовыеЦели</name>
  <predefined>
    <items>
      <name>ОбщиеНакопления</name>
      <description>Общие накопления (без указания цели)</description>
    </items>
  </predefined>
  <attributes>
    <name>Активность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеФинансовойЦели</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Срок</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонНакопления</name>
    <type>
      <types>DocumentRef.Доход</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/СтатьиДоходов/СтатьиДоходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатьиДоходов</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ОбменВалюты</name>
      <description>Обмен валюты</description>
    </items>
    <items>
      <name>ПрочиеДоходы</name>
      <description>Прочие доходы</description>
    </items>
    <items>
      <name>ИзменениеОстатка</name>
      <description>Изменение остатка</description>
    </items>
  </predefined>
  <attributes>
    <name>Активность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПропускатьВводКомментария</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКомментарийПоУмолчанию</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/СтатьиРасходов/СтатьиРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатьиРасходов</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ИзменениеОстатка</name>
      <description>Изменение остатка</description>
    </items>
    <items>
      <name>ОбменВалюты</name>
      <description>Обмен валюты</description>
    </items>
    <items>
      <name>ПрочиеРасходы</name>
      <description>Прочие расходы</description>
    </items>
  </predefined>
  <attributes>
    <name>Активность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличественныйУчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПропускатьВводКомментария</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКомментарийПоУмолчанию</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/ChartsOfAccounts/РазделыУчета/РазделыУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>РазделыУчета</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Деньги</name>
      <description>Деньги</description>
      <code>100</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>СвободныеДеньги</name>
        <description>Свободные деньги</description>
        <code>100.01</code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>Накопления</name>
        <description>Накопления</description>
        <code>100.10</code>
        <accountType>ActivePassive</accountType>
      </childItems>
    </items>
    <items>
      <name>Имущество</name>
      <description>Имущество</description>
      <code>200</code>
    </items>
    <items>
      <name>Долги</name>
      <description>Долги</description>
      <code>500</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>ОсновныеСуммыДолгов</name>
        <description>Основные суммы долгов</description>
        <code>500.10</code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>ПроцентыПоДолгам</name>
        <description>Проценты по долгам</description>
        <code>500.20</code>
        <accountType>ActivePassive</accountType>
      </childItems>
    </items>
    <items>
      <name>Капитал</name>
      <description>Капитал</description>
      <code>900</code>
      <accountType>Passive</accountType>
    </items>
  </predefined>
  <attributes>
    <name>ЗаголовокДляСубконтоПоДебету</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаголовокДляСубконтоПоКредиту</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:ChartOfAccounts>

src/Documents/ВводИзменениеОстатка/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	// Заполняем документ данными заполнения
	Если ДанныеЗаполнения <> Неопределено И ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ОбщегоНазначенияДеньги.ЗаполнитьОбъектПоСтруктуре(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;

	// Проверяем реквизиты нового документа в соответствии с настройками пользователя
	ОбслуживаниеДокументов.ПроверитьЗаполнениеНовогоДокумента(ЭтотОбъект);
	
	// Проверяем соответствие объекта и раздела учетов
	РазделыУчета.ПроверитьЗначенияРазделаИОбъектаУчета(РазделУчета, ОбъектУчета);
	
	Если ТипЗнч(ОбъектУчета) = Тип("СправочникСсылка.КошелькиИСчета") И
			ОбъектУчета.ИспользоватьДляНакоплений И НЕ ЗначениеЗаполнено(ФинансоваяЦель) Тогда
		ФинансоваяЦель = Справочники.ФинансовыеЦели.ОбщиеНакопления;
	КонецЕсли; 
	
	ВалютаОперации = ?(ЗначениеЗаполнено(ОбъектУчета), ОбъектУчета.Валюта, Константы.ВалютаУчета.Получить());

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	// Очищаем реквизиты, не подлежащие копированию
	Пользователь = Неопределено;
	Дата         = Неопределено;
	
	// Проверяем реквизиты нового документа в соответствии с настройками пользователя
	ОбслуживаниеДокументов.ПроверитьЗаполнениеНовогоДокумента(ЭтотОбъект, Истина);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если ОбменДанными.Загрузка ИЛИ ЭтоШаблон Тогда
		Возврат;
	КонецЕсли; 
	
	Движения.ЖурналОпераций.Записывать            = Истина;
	Движения.ФактическиеОборотыБюджета.Записывать = Истина;
	СформироватьПроводки(Движения.ЖурналОпераций, Движения.ФактическиеОборотыБюджета);
	
	// Проверим границы последовательности
	ПоследовательностьМенеджер = Последовательности.ВводИзменениеОстатков;
	ОтборГраниц = Новый Структура("РазделУчета, ОбъектУчета", РазделУчета, ОбъектУчета);
	МоментВремени = МоментВремени();
	
	// Передвинем границу вперед, если возможно
	Если ПоследовательностьМенеджер.Проверить(МоментВремени, ОтборГраниц) Тогда
		ПоследовательностьМенеджер.УстановитьГраницу(МоментВремени, ОтборГраниц);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Проверку раздела учета выполняем даже в случае загрузки
	РазделыУчета.ЗаполнитьРазделУчетаПоОбъекту(РазделУчета, ОбъектУчета);
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	// Проверяем зависимые реквизиты
	ВалютаОперации = ?(ЗначениеЗаполнено(ОбъектУчета) И ЗначениеЗаполнено(ОбъектУчета.Валюта), ОбъектУчета.Валюта, Константы.ВалютаУчета.Получить());
	РазделыУчета.ЗаполнитьФинансовуюЦельПоОбъектуУчета(ОбъектУчета, ФинансоваяЦель);
	
	// Готовим к записи движения
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение ИЛИ РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		
		// Очистим движения
		Если НЕ ЭтотОбъект.ЭтоНовый() Тогда
			
			ЭтотОбъект.Движения.ЖурналОпераций.Записать();
			ЭтотОбъект.Движения.ФактическиеОборотыБюджета.Записать();
			
			Если ДополнительныеСвойства.Свойство("НеВосстанавливатьПоследовательность") 
				Или ДополнительныеСвойства.Свойство("ОтложенноеПроведение") Тогда
				// Проведение документа инициировано из модуля набора записей последовательности или при проведении загруженных данных.
				// Скопируем свойство в набор записей последовательности, связанный с этим документом.
				ПринадлежностьПоследовательностям.ВводИзменениеОстатков.ДополнительныеСвойства.Вставить(
					"НеВосстанавливатьПоследовательность", Истина);
				// Отменим регистрацию изменений.
				ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
				ОбменДанными.Получатели.Очистить();
			КонецЕсли;
			
		КонецЕсли;
		
		// Рассчитаем суммы корректировок
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			Документы.ВводИзменениеОстатка.РассчитатьСуммуДоходаИлиРасхода(ЭтотОбъект);
		ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
			СуммаДохода  = 0;
			СуммаРасхода = 0;
		КонецЕсли;
		
	КонецЕсли;

	// Заполним информационные реквизиты документа
	ПредставлениеНовогоОстатка = НСтр("ru='Остаток: %1 %2'"); 
	ПредставлениеНовогоОстатка = СтрШаблон(ПредставлениеНовогоОстатка, Формат(СуммаНовогоОстатка, "ЧДЦ=2"), ВалютаОперации);
	
	Если ЗначениеЗаполнено(СуммаНовогоОстаткаПроцентов) Тогда
		ПредставлениеНовогоОстаткаПроцентов = НСтр("ru='Остаток %%: %1 %2'"); 
		ПредставлениеНовогоОстаткаПроцентов = СтрШаблон(ПредставлениеНовогоОстаткаПроцентов, Формат(СуммаНовогоОстаткаПроцентов, "ЧДЦ=2"), ВалютаОперации);
	КонецЕсли;
	
	ОписаниеОперации = "";
	
	Если РазделУчета.Родитель = ПланыСчетов.РазделыУчета.Деньги Тогда
		ОписаниеОперации = НСтр("ru='Изменен остаток в кошельке ['")    + ОбъектУчета + "]";
		Если ОбъектУчета.ИспользоватьДляНакоплений Тогда
			ОписаниеОперации = ОписаниеОперации + НСтр("ru = 'на финансовую цель ['") + ФинансоваяЦель + "]";
		КонецЕсли; 
	ИначеЕсли РазделУчета = ПланыСчетов.РазделыУчета.Имущество Тогда
		ОписаниеОперации = НСтр("ru='Изменена стоимость имущества ['")  + ОбъектУчета + "]";
	ИначеЕсли РазделУчета = ПланыСчетов.РазделыУчета.ОсновныеСуммыДолгов Тогда
		Если ОбъектУчета.ИспользоватьДляУчетаВыданныхДолгов И ОбъектУчета.ИспользоватьДляУчетаВзятыхДолгов Тогда
			ОписаниеОперации = НСтр("ru='Изменен остаток взаиморасчетов ['")	+ ОбъектУчета + "]";
		ИначеЕсли ОбъектУчета.ИспользоватьДляУчетаВыданныхДолгов Тогда
			ОписаниеОперации = НСтр("ru='Изменен остаток долга нам ['")         	+ ОбъектУчета + "]";
		ИначеЕсли ОбъектУчета.ИспользоватьДляУчетаВзятыхДолгов Тогда
			ОписаниеОперации = НСтр("ru='Изменен остаток нашего долга ['")       	+ ОбъектУчета + "]";
		КонецЕсли;
	КонецЕсли;
	 
	Если ЗначениеЗаполнено(Комментарий) Тогда
		ОписаниеОперации = ОписаниеОперации + " (" + Комментарий + ")";
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	// Заполним таблицу объектов для быстрого отбора операций
	ЗаполнитьТаблицуОбъектовОперации();
	
	ОбслуживаниеДокументов.ПриЗаписиОбъектаДокумента(ЭтотОбъект);
	
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура СформироватьПроводки(ЖурналОперацийНаборЗаписей, ОборотыБюджетаНаборЗаписей)

	СуммыКорректировок = Неопределено;
	Если НЕ ДополнительныеСвойства.Свойство("СуммыКорректировок", СуммыКорректировок) Тогда
		ВызватьИсключение "Суммы корректировок не определены";
	КонецЕсли;
	
 	ВалютаОперации = ?(ЗначениеЗаполнено(ОбъектУчета), ОбъектУчета.Валюта, Константы.ВалютаУчета.Получить());
	
	ФормироватьОборотБюджета = ТипЗнч(ОбъектУчета) = Тип("СправочникСсылка.КошелькиИСчета") И ОбъектУчета.ТипСчета <> Перечисления.ТипыСчетов.БанковскаяКартаКредитная;

	Если СуммыКорректировок.СуммаДоходаОсновная <> 0 ИЛИ СуммыКорректировок.СуммаРасходаОсновная <> 0 Тогда
		
		// Проводка в журнал операций
		НоваяПроводка = ЖурналОперацийНаборЗаписей.Добавить();
		НоваяПроводка.Регистратор = Ссылка;
		НоваяПроводка.Период = Дата;
		НоваяПроводка.Валюта = ВалютаОперации;
		СвойстваСчета = РазделыУчетаПовтИсп.ПолучитьСвойстваСчета(РазделУчета);
		НоваяПроводка.Содержание    = Комментарий;

		// Запись оборота бюджета
		Если ФормироватьОборотБюджета Тогда
			НовыйОборот = ОборотыБюджетаНаборЗаписей.Добавить();
			НовыйОборот.Регистратор   = Ссылка;
			НовыйОборот.Период        = Дата;
			НовыйОборот.РазделБюджета = ФинансоваяЦель;
			НовыйОборот.Кошелек       = ОбъектУчета;
			НовыйОборот.Валюта        = ВалютаОперации;
			НовыйОборот.Комментарий   = Комментарий;
		КонецЕсли;
		
		Если СуммыКорректировок.СуммаДоходаОсновная <> 0 Тогда
			
			// Проводка в журнал операций
			НоваяПроводка.СчетДт = РазделУчета;
			НоваяПроводка.СубконтоДт.Вставить(СвойстваСчета.ВидСубконто1, ОбъектУчета);
			Если СвойстваСчета.КоличествоСубконто > 1 Тогда
				НоваяПроводка.СубконтоДт.Вставить(СвойстваСчета.ВидСубконто2, ФинансоваяЦель);
			КонецЕсли; 

			НоваяПроводка.СчетКт = ПланыСчетов.РазделыУчета.Капитал;
			НоваяПроводка.СубконтоКт.Вставить(ПланыВидовХарактеристик.ВидыСубконто.СтатьиДоходовРасходов, Справочники.СтатьиДоходов.ИзменениеОстатка);
			
			НоваяПроводка.ВалютнаяСумма = СуммыКорректировок.СуммаДоходаОсновная;
			
			// Запись оборота бюджета
			Если ФормироватьОборотБюджета Тогда
				НовыйОборот.Сумма         = СуммыКорректировок.СуммаДоходаОсновная;
				НовыйОборот.ТипПоказателя = Перечисления.ТипыБюджетныхПоказателей.Поступление;
				НовыйОборот.СтатьяБюджета = Справочники.СтатьиДоходов.ИзменениеОстатка;
			КонецЕсли;
			
		ИначеЕсли СуммыКорректировок.СуммаРасходаОсновная <> 0 Тогда
			
			НоваяПроводка.СчетКт = РазделУчета;
			НоваяПроводка.СубконтоКт.Вставить(СвойстваСчета.ВидСубконто1, ОбъектУчета);
			Если СвойстваСчета.КоличествоСубконто > 1 Тогда
				НоваяПроводка.СубконтоКт.Вставить(СвойстваСчета.ВидСубконто2, ФинансоваяЦель);
			КонецЕсли; 

			НоваяПроводка.СчетДт = ПланыСчетов.РазделыУчета.Капитал;
			НоваяПроводка.СубконтоДт.Вставить(ПланыВидовХарактеристик.ВидыСубконто.СтатьиДоходовРасходов, Справочники.СтатьиРасходов.ИзменениеОстатка);
			
			НоваяПроводка.ВалютнаяСумма = СуммыКорректировок.СуммаРасходаОсновная;
			
			// Запись оборота бюджета
			Если ФормироватьОборотБюджета Тогда
				НовыйОборот.Сумма         = СуммыКорректировок.СуммаРасходаОсновная;
				НовыйОборот.ТипПоказателя = Перечисления.ТипыБюджетныхПоказателей.Списание;
				НовыйОборот.СтатьяБюджета = Справочники.СтатьиРасходов.ИзменениеОстатка;
			КонецЕсли;
			
		КонецЕсли; 

	КонецЕсли; 

	Если СуммыКорректировок.СуммаДоходаПоПроцентам <> 0 ИЛИ СуммыКорректировок.СуммаРасходаПоПроцентам <> 0 Тогда
		
		НоваяПроводка = ЖурналОперацийНаборЗаписей.Добавить();
		НоваяПроводка.Регистратор = Ссылка;
		НоваяПроводка.Период = Дата;
		НоваяПроводка.Валюта = ВалютаОперации;
		СчетПроцентов = ПланыСчетов.РазделыУчета.ПроцентыПоДолгам;
		СвойстваСчета = РазделыУчетаПовтИсп.ПолучитьСвойстваСчета(СчетПроцентов);
		НоваяПроводка.Содержание = Комментарий;
		
		Если СуммыКорректировок.СуммаДоходаПоПроцентам <> 0 Тогда
			
			НоваяПроводка.СчетДт = СчетПроцентов;
			НоваяПроводка.СубконтоДт.Вставить(СвойстваСчета.ВидСубконто1, ОбъектУчета);

			НоваяПроводка.СчетКт = ПланыСчетов.РазделыУчета.Капитал;
			НоваяПроводка.СубконтоКт.Вставить(ПланыВидовХарактеристик.ВидыСубконто.СтатьиДоходовРасходов, Справочники.СтатьиДоходов.ИзменениеОстатка);
			
			НоваяПроводка.ВалютнаяСумма = СуммыКорректировок.СуммаДоходаПоПроцентам;
			
		ИначеЕсли СуммыКорректировок.СуммаРасходаПоПроцентам <> 0 Тогда
			
			НоваяПроводка.СчетКт = СчетПроцентов;
			НоваяПроводка.СубконтоКт.Вставить(СвойстваСчета.ВидСубконто1, ОбъектУчета);

			НоваяПроводка.СчетДт = ПланыСчетов.РазделыУчета.Капитал;
			НоваяПроводка.СубконтоДт.Вставить(ПланыВидовХарактеристик.ВидыСубконто.СтатьиДоходовРасходов, Справочники.СтатьиРасходов.ИзменениеОстатка);
			
			НоваяПроводка.ВалютнаяСумма = СуммыКорректировок.СуммаРасходаПоПроцентам;
			
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуОбъектовОперации() Экспорт

	ТаблицаОбъектов = ОбслуживаниеДокументов.НоваяТаблицаРегистраОбъектыОпераций();
	
	ФинЦель = ?(ЗначениеЗаполнено(ФинансоваяЦель) И ФинансоваяЦель <> Справочники.ФинансовыеЦели.ОбщиеНакопления, 
		ФинансоваяЦель, Неопределено);
		
	ЗаписьОбъектаУчета = ТаблицаОбъектов.Добавить();
	ЗаписьОбъектаУчета.Дата           = Дата;
	ЗаписьОбъектаУчета.Операция       = Ссылка;
	ЗаписьОбъектаУчета.РазделУчета    = РазделУчета;
	ЗаписьОбъектаУчета.ПредметУчета   = ОбъектУчета;
	ЗаписьОбъектаУчета.ФинансоваяЦель = ФинЦель;
	Если ЗаписьОбъектаУчета.РазделУчета = ПланыСчетов.РазделыУчета.Деньги 
		ИЛИ ЗаписьОбъектаУчета.РазделУчета.Родитель = ПланыСчетов.РазделыУчета.Деньги  Тогда
		Если СуммаДохода > 0 Тогда 
			ЗаписьОбъектаУчета.ТипПоказателя = Перечисления.ТипыБюджетныхПоказателей.Поступление;
		Иначе
			ЗаписьОбъектаУчета.ТипПоказателя = Перечисления.ТипыБюджетныхПоказателей.Списание;
		КонецЕсли; 
	КонецЕсли; 
	Если СуммаДохода > 0 Тогда 
		ЗаписьОбъектаУчета.СуммаПоступления = СуммаДохода;
	Иначе
		ЗаписьОбъектаУчета.СуммаСписания = СуммаРасхода;
	КонецЕсли; 
	ЗаписьОбъектаУчета.Валюта = ВалютаОперации;

	ЗаписьСтатьи = ТаблицаОбъектов.Добавить();
	ЗаписьСтатьи.Дата           = Дата;
	ЗаписьСтатьи.Операция       = Ссылка;
	ЗаписьСтатьи.РазделУчета    = ПланыСчетов.РазделыУчета.Капитал;
	ЗаписьСтатьи.ФинансоваяЦель = ФинЦель;
	Если СуммаДохода > 0 Тогда 
		ЗаписьСтатьи.ТипПоказателя    = Перечисления.ТипыБюджетныхПоказателей.Поступление;
		ЗаписьСтатьи.ПредметУчета     = Справочники.СтатьиДоходов.ИзменениеОстатка;
		ЗаписьСтатьи.СуммаПоступления = СуммаДохода;
	Иначе
		ЗаписьСтатьи.ТипПоказателя    = Перечисления.ТипыБюджетныхПоказателей.Списание;
		ЗаписьСтатьи.ПредметУчета     = Справочники.СтатьиРасходов.ИзменениеОстатка;
		ЗаписьСтатьи.СуммаСписания    = СуммаРасхода;
	КонецЕсли; 
	ЗаписьСтатьи.Валюта = ВалютаОперации;
	
	Если ЗначениеЗаполнено(ФинЦель) Тогда
		
		ЗаписьНабора = ТаблицаОбъектов.Добавить();
		ЗаполнитьЗначенияСвойств(ЗаписьНабора, ЗаписьОбъектаУчета);
		ЗаписьНабора.ФинансоваяЦель = Неопределено;
		
		ЗаписьНабора = ТаблицаОбъектов.Добавить();
		ЗаполнитьЗначенияСвойств(ЗаписьНабора, ЗаписьСтатьи);
		ЗаписьНабора.ФинансоваяЦель = Неопределено;
		
	КонецЕсли; 
	
	ДополнительныеСвойства.Вставить("ТаблицыДокумента", Новый Структура);
	ДополнительныеСвойства.ТаблицыДокумента.Вставить("ОбъектыОперации", ТаблицаОбъектов);
	
КонецПроцедуры

#КонецОбласти	


#КонецЕсли
